#include <iostream>

//this指针，就是在class里面解决名称冲突的问题，还有*this就是解析自己的位置，解析就过就是这个class的别名，如果是函数的返还的话，需要&表示别名
class aaa{
public:
    void test(int age){
        this->age = age;//使用this指针就会直接指向当前使用的这个class的指针
    }

    int age;
};

class a{//每次代码运行创建一个类的时候，编译器都会自己调用构造函数，销毁的时候也会有析构函数，这两个函数不用写返回值，只需要名字
    //编译器自己调用的不会有其他功能就是空函数，代码写了就会调用写的//所以这是自带的
public:
    a(){//无参构造函数
        std::cout << "无参构造" << std::endl;
    }
    a(int a){//有参构造函数
        std::cout << "有参构造" << std::endl;
    }
    a(const a &b){//拷贝构造函数，需要使用常量别名传递，不改变原值嘛//当然自己写了的话就不会拷贝只是传值，如果是编译器默认的拷贝
        //就会直接复制传入的类的全部值，无论是否私有
        //但是使用编译器的自带的拷贝构造函数，直接拷贝，在有堆区操作的时候会把堆区的指针也是直接的复制，那在析构的时候就会出现两个消除
        //一起消除一个地址就会报错，所以就觉办法是深拷贝，也就就是自己在自己的构造函数里面自己写一个新的指针生成，主要是控制堆区
        std::cout << "拷贝构造" << std::endl;
    }

    ~a(){
            std::cout << "析构" << std::endl;
    }
};

class bb{
    bb(int cc):a(10), b(20), c(cc)//这种写法就是列表初始化，主要是用来做批量初始化的
    {

    }

    int a;
    int b;
    int c;
};

void test(){
    a a1;//默认构造无括号，写括号就当成声明了
    a a2(1);
    a a3(a1);
    a a4 = 10;//==a a4 = a (10)//a(10)会直接进行构建然后析构
}

int main(void){
    test();
}