#include<iostream>

//首先多态分成静态和动态的多态，静态多态就是前面已经学过的函数重载和运算符重载等，总之就是复用重复的名字的东西就是多种形态--多态
//上面说的是静态多态，他和动态多态的区别就是静态多态的东西在代码编译的时候就已经他确定函数的指针位置，但是动态多态的一些指针位置都是运行中产生的

class aaa{
public:
    aaa(){//注意构造函数不能是虚函数，因为虚函数本质就是编译的时候使用虚指针查找表，如果构造都是虚函数，那根本就不能创建类

    }

    virtual ~aaa() = 0;

    virtual void aa() = 0;//这种是纯虚函数，使用一样的，不过这种类叫做抽象类，特点是不能创建对象，也就是这个类只能用来继承
    //同时他的子类就必须要重写他的这个虚函数，否则也属于抽象类也就不能实例化
};
//这个地方必须要说的一点是，构造函数和析构函数，还记得前面说的继承的时候是先构造父类，然后构造子类，再析构子类，析构父类
//但是使用父类指针传入子类，也就是想使用多态的方式，如果不使用虚函数就会出现在子类构造的时候正常，但是子类进行析构的时候出现
//调用父类的析构而不是子类的析构，如果这个时候子类的代码中包含堆区内存的时候的时候就会出现没有调用析构函数清除的问题
//所以在父类的析构函数也需要使用虚函数，这样就会在子类析构时调用子类的虚构函数，就不会漏掉，但是注意直接纯虚析构是不行的
//需要像函数声明一样在下面写上虚构的实现，不然不能实例化，像下面的这个一样
aaa:: ~aaa(){

}

class animal{
public:
    //虚函数
    virtual void speak(){//如果没有virtual，就是常规函数，那么在下面的speak函数中，animal别名就会直接调用父类
        //但是增加virtual后就会后定位，就可以直接通过子类输入定位
        //注意动态多态的使用是需要有函数重写的，注意不是重载重载是函数的一些数据不一样导致导向的函数不一样，重写是完全同名同参数
        std::cout << "动物说话" << std::endl;
    }
};

class cat: public animal{
public:
    void speak(){
        std::cout << "小猫说话" << std::endl;
    }
};

class dog: public animal{
public:
    void speak(){
        std::cout << "小狗说话" << std::endl;
    }
};

void speak(animal &animal){
    animal.speak();
}

int main(){
    cat cat;
    speak(cat);//之所以可以使用直接传子类调用子类就是因为在父类中使用的是虚函数，虚函数就是动态多态，不会在代码开始的时候就指定指针位置

    dog dog;
    speak(dog);
}